storage/tests/4bea176d-e018-4a78-8913-2bd335d0c37c/k6.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /home/user/Desktop/simple load testing/backend/storage/tests/4bea176d-e018-4a78-8913-2bd335d0c37c/script.js
        output: -

     scenarios: (100.00%) 1 scenario, 10 max VUs, 40s max duration (incl. graceful stop):
              * default: 10 looping VUs for 10s (gracefulStop: 30s)


running (01.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [  10% ] 10 VUs  01.0s/10s

running (02.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [  20% ] 10 VUs  02.0s/10s

running (03.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [  30% ] 10 VUs  03.0s/10s

running (04.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [  40% ] 10 VUs  04.0s/10s

running (05.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [  50% ] 10 VUs  05.0s/10s

running (06.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [  60% ] 10 VUs  06.0s/10s

running (07.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [  70% ] 10 VUs  07.0s/10s

running (08.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [  80% ] 10 VUs  08.0s/10s

running (09.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [  90% ] 10 VUs  09.0s/10s

running (10.0s), 10/10 VUs, 1 complete and 0 interrupted iterations
default   [ 100% ] 10 VUs  10.0s/10s

running (11.0s), 10/10 VUs, 1 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  10s

running (12.0s), 08/10 VUs, 3 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  10s

running (13.0s), 05/10 VUs, 6 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  10s

running (14.0s), 03/10 VUs, 8 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  10s

running (15.0s), 02/10 VUs, 9 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  10s

running (16.0s), 01/10 VUs, 10 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  10s

running (17.0s), 01/10 VUs, 10 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  10s

running (18.0s), 01/10 VUs, 10 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  10s

running (19.0s), 01/10 VUs, 10 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  10s

running (20.0s), 01/10 VUs, 10 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  10s

running (21.0s), 01/10 VUs, 10 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  10s

running (22.0s), 01/10 VUs, 10 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  10s

running (23.0s), 01/10 VUs, 10 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  10s


  █ TOTAL RESULTS 

    checks_total.......: 55     2.298041/s
    checks_succeeded...: 81.81% 45 out of 55
    checks_failed......: 18.18% 10 out of 55

    ✗ status ok
      ↳  81% — ✓ 45 / ✗ 10

    HTTP
    http_req_duration..............: avg=173.96ms min=4.95ms med=9.33ms max=954.67ms p(90)=542.94ms p(95)=735.42ms
      { expected_response:true }...: avg=77.7ms   min=4.95ms med=8.83ms max=343.52ms p(90)=275.59ms p(95)=298.63ms
    http_req_failed................: 18.18% 10 out of 55
    http_reqs......................: 55     2.298041/s

    EXECUTION
    iteration_duration.............: avg=12.8s    min=9.38s  med=12.7s  max=15.06s   p(90)=14.93s   p(95)=14.99s  
    iterations.....................: 11     0.459608/s
    vus............................: 1      min=1        max=10
    vus_max........................: 10     min=10       max=10

    NETWORK
    data_received..................: 33 kB  1.4 kB/s
    data_sent......................: 17 kB  688 B/s



running (23.9s), 00/10 VUs, 11 complete and 0 interrupted iterations
default ✓ [ 100% ] 10 VUs  10s